bigjohnson/Osso/avr/boards.txt
menu.cpu_speed=CPU Speed(MHz)

##############################################################

ossointernal.name=Osso internal clock

ossointernal.vid.0=0x2341
ossointernal.pid.0=0x0043
ossointernal.vid.1=0x2341
ossointernal.pid.1=0x0001
ossointernal.vid.2=0x2A03
ossointernal.pid.2=0x0043
ossointernal.vid.3=0x2341
ossointernal.pid.3=0x0243

ossointernal.upload.tool=arduino:avrdude
ossointernal.upload.protocol=arduino
ossointernal.upload.maximum_size=32256
ossointernal.upload.maximum_data_size=2048

ossointernal.bootloader.tool=arduino:avrdude
ossointernal.bootloader.high_fuses=0xD6
#ossointernal.bootloader.extended_fuses=0xFD
ossointernal.bootloader.unlock_bits=0x3F
ossointernal.bootloader.lock_bits=0x0F

ossointernal.build.mcu=atmega328p
ossointernal.build.board=AVR_UNO
ossointernal.build.core=arduino:arduino
ossointernal.build.variant=ossointernal

## Osso 128KHz internal oscillator
## --------------------------------------------------
ossointernal.menu.cpu_speed.128KHzInternalClock=128KHz osc
ossointernal.menu.cpu_speed.128KHzInternalClock.build.f_cpu=128000L
#ossointernal.menu.cpu_speed.128KHzInternalClock.bootloader.file=osso/optiboot_atmega328p_1200_128000L.hex
ossointernal.menu.cpu_speed.128KHzInternalClock.bootloader.file=osso/optiboot_atmega328_01M_004800_D13.hex
ossointernal.menu.cpu_speed.128KHzInternalClock.bootloader.low_fuses=0xE3
ossointernal.menu.cpu_speed.128KHzInternalClock.bootloader.extended_fuses=0xFE
#ossointernal.menu.cpu_speed.128KHzInternalClock.upload.speed=1200
ossointernal.menu.cpu_speed.128KHzInternalClock.upload.speed=4800

## Osso 1MHz = 8MHz osc / 8 by fuses internal oscillator
## --------------------------------------------------
ossointernal.menu.cpu_speed.8/8MHzInternalClock=1MHz = 8MHz osc / 8 by fuses
ossointernal.menu.cpu_speed.8/8MHzInternalClock.build.f_cpu=1000000L
ossointernal.menu.cpu_speed.8/8MHzInternalClock.bootloader.file=osso/optiboot_atmega328p_9600_1000000L.hex
#ossointernal.menu.cpu_speed.8/8MHzInternalClock.bootloader.file=osso/optiboot_atmega328_1000000_125000.hex
ossointernal.menu.cpu_speed.8/8MHzInternalClock.bootloader.low_fuses=0x62
ossointernal.menu.cpu_speed.8/8MHzInternalClock.bootloader.extended_fuses=0xFE
ossointernal.menu.cpu_speed.8/8MHzInternalClock.upload.speed=9600
#ossointernal.menu.cpu_speed.8/8MHzInternalClock.upload.speed=125000

## Osso 8MHz internal oscillator osc
## --------------------------------------------------
ossointernal.menu.cpu_speed.8MHzInternalClock=8MHz osc
ossointernal.menu.cpu_speed.8MHzInternalClock.build.f_cpu=8000000L
ossointernal.menu.cpu_speed.8MHzInternalClock.bootloader.file=osso/optiboot_atmega328p_38400_8000000L.hex
ossointernal.menu.cpu_speed.8MHzInternalClock.bootloader.low_fuses=0xE2
ossointernal.menu.cpu_speed.8MHzInternalClock.bootloader.extended_fuses=0xFD
ossointernal.menu.cpu_speed.8MHzInternalClock.upload.speed=38400


##############################################################

ossoexternal.name=Osso external clock

ossoexternal.vid.0=0x2341
ossoexternal.pid.0=0x0043
ossoexternal.vid.1=0x2341
ossoexternal.pid.1=0x0001
ossoexternal.vid.2=0x2A03
ossoexternal.pid.2=0x0043
ossoexternal.vid.3=0x2341
ossoexternal.pid.3=0x0243

ossoexternal.upload.tool=arduino:avrdude
ossoexternal.upload.protocol=arduino
ossoexternal.upload.maximum_size=32256
ossoexternal.upload.maximum_data_size=2048

ossoexternal.bootloader.tool=arduino:avrdude
ossoexternal.bootloader.high_fuses=0xD6
#ossoexternal.bootloader.extended_fuses=0xFD
ossoexternal.bootloader.unlock_bits=0x3F
ossoexternal.bootloader.lock_bits=0x0F

ossoexternal.build.mcu=atmega328p
ossoexternal.build.board=AVR_UNO
ossoexternal.build.core=arduino:arduino
ossoexternal.build.variant=ossoexternal

## Osso 128KHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.128KHzExternalClock=128KHz xtal
ossoexternal.menu.cpu_speed.128KHzExternalClock.build.f_cpu=128000L
ossoexternal.menu.cpu_speed.128KHzExternalClock.bootloader.file=osso/optiboot_atmega328p_1200_128000L.hex
ossoexternal.menu.cpu_speed.128KHzExternalClock.bootloader.low_fuses=0xE0
ossoexternal.menu.cpu_speed.128KHzExternalClock.bootloader.extended_fuses=FE
ossoexternal.menu.cpu_speed.128KHzExternalClock.upload.speed=1200

## Osso 1MHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.1MHzExternalClock=1MHz xtal
ossoexternal.menu.cpu_speed.1MHzExternalClock.build.f_cpu=1000000L
ossoexternal.menu.cpu_speed.1MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_9600_1000000L.hex
ossoexternal.menu.cpu_speed.1MHzExternalClock.bootloader.low_fuses=0xFB
ossoexternal.menu.cpu_speed.1MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternal.menu.cpu_speed.1MHzExternalClock.upload.speed=9600

## Osso 1MHz = 8MHz xtal / 8 external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8=1Mhz = 8MHz xtal / 8 by fuses
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8.build.f_cpu=1000000L
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8.bootloader.file=osso/optiboot_atmega328p_9600_1000000L.hex
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8.bootloader.low_fuses=0x7F
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8.bootloader.extended_fuses=0xFE
ossoexternal.menu.cpu_speed.8/8MHzExternalClock_8.upload.speed=9600

## Osso 2MHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.2MHzExternalClock=2MHz xtal
ossoexternal.menu.cpu_speed.2MHzExternalClock.build.f_cpu=2000000L
ossoexternal.menu.cpu_speed.2MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_115200_2000000L.hex
ossoexternal.menu.cpu_speed.2MHzExternalClock.bootloader.low_fuses=0x7B
ossoexternal.menu.cpu_speed.2MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternal.menu.cpu_speed.2MHzExternalClock.upload.speed=115200

## Osso 2MHz = 16MHz xtal / 8 external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8=2Mhz = 16MHz  xtal / 8 by fuses
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8.build.f_cpu=2000000L
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8.bootloader.file=osso/optiboot_atmega328_2MHz_19200.hex
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8.bootloader.low_fuses=0x7F
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8.bootloader.extended_fuses=0xFE
ossoexternal.menu.cpu_speed.16/8MHzExternalClock_8.upload.speed=19200

## Osso 8MHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.8MHzExternalClock=8MHz xtal
ossoexternal.menu.cpu_speed.8MHzExternalClock.build.f_cpu=8000000L
ossoexternal.menu.cpu_speed.8MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_38400_8000000L.hex
ossoexternal.menu.cpu_speed.8MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternal.menu.cpu_speed.8MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternal.menu.cpu_speed.8MHzExternalClock.upload.speed=38400

## Osso 16MHz xtal external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.16MHzExternalClock=16MHz xtal
ossoexternal.menu.cpu_speed.16MHzExternalClock.build.f_cpu=16000000L
ossoexternal.menu.cpu_speed.16MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_115200_16000000L.hex
ossoexternal.menu.cpu_speed.16MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternal.menu.cpu_speed.16MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternal.menu.cpu_speed.16MHzExternalClock.upload.speed=115200

## Osso 20MHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.20MHzExternalClock=20MHz xtal
ossoexternal.menu.cpu_speed.20MHzExternalClock.build.f_cpu=20000000L
ossoexternal.menu.cpu_speed.20MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_115200_20000000L.hex
ossoexternal.menu.cpu_speed.20MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternal.menu.cpu_speed.20MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternal.menu.cpu_speed.20MHzExternalClock.upload.speed=115200

## Osso 27MHz external
## --------------------------------------------------
ossoexternal.menu.cpu_speed.27MHzExternalClock=27MHz xtal
ossoexternal.menu.cpu_speed.27MHzExternalClock.build.f_cpu=27000000L
ossoexternal.menu.cpu_speed.27MHzExternalClock.bootloader.file=osso/optiboot_atmega328p_115200_27000000L.hex
ossoexternal.menu.cpu_speed.27MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternal.menu.cpu_speed.27MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternal.menu.cpu_speed.27MHzExternalClock.upload.speed=115200

##############################################################

ossointernalnb.name=Osso internal clock no bootloader

ossointernalnb.vid.0=0x2341
ossointernalnb.pid.0=0x0043
ossointernalnb.vid.1=0x2341
ossointernalnb.pid.1=0x0001
ossointernalnb.vid.2=0x2A03
ossointernalnb.pid.2=0x0043
ossointernalnb.vid.3=0x2341
ossointernalnb.pid.3=0x0243

ossointernalnb.upload.tool=avrdude
ossointernalnb.upload.maximum_size=32256
ossointernalnb.upload.maximum_data_size=2048

ossointernalnb.bootloader.tool=arduino:avrdude
ossointernalnb.bootloader.high_fuses=0xD6
#ossointernalnb.bootloader.extended_fuses=0x05
ossointernalnb.bootloader.unlock_bits=0xFF
ossointernalnb.bootloader.lock_bits=0xFF

ossointernalnb.build.mcu=atmega328p
ossointernalnb.build.board=AVR_UNO
ossointernalnb.build.core=arduino:arduino
ossointernalnb.build.variant=ossointernal
ossointernalnb.bootloader.file=empty/empty.hex

## Osso 16KHz = 128KHz osc / 8 by fuses internal oscillator
## --------------------------------------------------
ossointernalnb.menu.cpu_speed.128/8KHzInternalClock=16KHz = 128KHz osc / 8 by fuses
ossointernalnb.menu.cpu_speed.128/8KHzInternalClock.build.f_cpu=16000L
ossointernalnb.menu.cpu_speed.128/8KHzInternalClock.bootloader.low_fuses=0x63
ossointernalnb.menu.cpu_speed.128/8MHzExternalClock.bootloader.extended_fuses=0xFE
ossointernalnb.menu.cpu_speed.128/8KHzInternalClock.upload.speed=100

## Osso 128KHz internal oscillator
## --------------------------------------------------
ossointernalnb.menu.cpu_speed.128KHzInternalClock=128KHz osc
ossointernalnb.menu.cpu_speed.128KHzInternalClock.build.f_cpu=128000L
ossointernalnb.menu.cpu_speed.128KHzInternalClock.bootloader.low_fuses=0xE3
ossointernalnb.menu.cpu_speed.128MHzExternalClock.bootloader.extended_fuses=0xFE
ossointernalnb.menu.cpu_speed.128KHzInternalClock.upload.speed=1200

## Osso 1MHz = 8MHz osc / 8 by fuses internal oscillator
## --------------------------------------------------
ossointernalnb.menu.cpu_speed.8/8MHzInternalClock=1MHz = 8MHz osc / 8 by fuses
ossointernalnb.menu.cpu_speed.8/8MHzInternalClock.build.f_cpu=1000000L
ossointernalnb.menu.cpu_speed.8/8MHzInternalClock.bootloader.low_fuses=0x62
ossointernalnb.menu.cpu_speed.8/8MHzInternalClock.bootloader.extended_fuses=0xFE
ossointernalnb.menu.cpu_speed.8/8MHzInternalClock.upload.speed=9600

## Osso 8MHz internal oscillator
## --------------------------------------------------
ossointernalnb.menu.cpu_speed.8MHzInternalClock=8MHz osc
ossointernalnb.menu.cpu_speed.8MHzInternalClock.build.f_cpu=8000000L
ossointernalnb.menu.cpu_speed.8MHzInternalClock.bootloader.low_fuses=0xE2
ossointernalnb.menu.cpu_speed.8MHzInternalClock.bootloader.extended_fuses=0xFD
ossointernalnb.menu.cpu_speed.8MHzInternalClock.upload.speed=38400

##############################################################

ossoexternalnb.name=Osso external clock no bootloader

ossoexternalnb.vid.0=0x2341
ossoexternalnb.pid.0=0x0043
ossoexternalnb.vid.1=0x2341
ossoexternalnb.pid.1=0x0001
ossoexternalnb.vid.2=0x2A03
ossoexternalnb.pid.2=0x0043
ossoexternalnb.vid.3=0x2341
ossoexternalnb.pid.3=0x0243

ossoexternalnb.upload.tool=avrdude
ossoexternalnb.upload.maximum_size=32256
ossoexternalnb.upload.maximum_data_size=2048

ossoexternalnb.bootloader.tool=arduino:avrdude
ossoexternalnb.bootloader.high_fuses=0xD6
#ossoexternalnb.bootloader.extended_fuses=0x05
ossoexternalnb.bootloader.unlock_bits=0x3F
ossoexternalnb.bootloader.lock_bits=0x0F
ossoexternalnb.bootloader.file=empty/empty.hex

ossoexternalnb.build.mcu=atmega328p
ossoexternalnb.build.board=AVR_UNO
ossoexternalnb.build.core=arduino:arduino
ossoexternalnb.build.variant=ossoexternal

## Osso 16KHz = 128KHz xtal / 8 by fuses external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.16KHzExternalClock=16KHz = 128KHz xtal / 8 by fuses
ossoexternalnb.menu.cpu_speed.16KHzExternalClock.build.f_cpu=16000L
ossoexternalnb.menu.cpu_speed.16KHzExternalClock.bootloader.low_fuses=0x60
ossoexternalnb.menu.cpu_speed.16MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternalnb.menu.cpu_speed.16KHzExternalClock.upload.speed=100

## Osso 128KHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.128KHzExternalClock=128KHz xtal
ossoexternalnb.menu.cpu_speed.128KHzExternalClock.build.f_cpu=128000L
ossoexternalnb.menu.cpu_speed.128KHzExternalClock.bootloader.low_fuses=0xE0
ossoexternalnb.menu.cpu_speed.128KHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternalnb.menu.cpu_speed.128HzExternalClock.upload.speed=1200

## Osso 1MHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.1MHzExternalClock=1MHz xtal
ossoexternalnb.menu.cpu_speed.1MHzExternalClock.build.f_cpu=1000000L
ossoexternalnb.menu.cpu_speed.1MHzExternalClock.bootloader.low_fuses=0xFB
ossoexternalnb.menu.cpu_speed.1MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternalnb.menu.cpu_speed.1MHzExternalClock.upload.speed=9600

## Osso 1MHz = 8MHz xtal / 8 by fuses external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.8MHz/2ExternalClock=1MHz = 8MHz xtal / 8 by fuses
ossoexternalnb.menu.cpu_speed.8MHz/2ExternalClock.build.f_cpu=1000000L
ossoexternalnb.menu.cpu_speed.8MHz/2ExternalClock.bootloader.low_fuses=0x7F
ossoexternalnb.menu.cpu_speed.8MHz/2ExternalClock.bootloader.extended_fuses=0xFE
ossoexternalnb.menu.cpu_speed.8MHz/2ExternalClock.upload.speed=9600

## Osso 2MHz = 16MHz xtal / 8 by fuses external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.2MHzExternalClock=2MHz = 16MHz xtal / 8 by fuses
ossoexternalnb.menu.cpu_speed.2MHzExternalClock.build.f_cpu=2000000L
ossoexternalnb.menu.cpu_speed.2MHzExternalClock.bootloader.low_fuses=0x7F
ossoexternalnb.menu.cpu_speed.2MHzExternalClock.bootloader.extended_fuses=0xFE
ossoexternalnb.menu.cpu_speed.2MHzExternalClock.upload.speed=9600

## Osso 8MHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.8MHzExternalClock=8MHz xtal
ossoexternalnb.menu.cpu_speed.8MHzExternalClock.build.f_cpu=8000000L
ossoexternalnb.menu.cpu_speed.8MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternalnb.menu.cpu_speed.8MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternalnb.menu.cpu_speed.8MHzExternalClock.upload.speed=38400

## Osso 16MHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.16MHzExternalClock=16MHz xtal
ossoexternalnb.menu.cpu_speed.16MHzExternalClock.build.f_cpu=16000000L
ossoexternalnb.menu.cpu_speed.16MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternalnb.menu.cpu_speed.16MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternalnb.menu.cpu_speed.16MHzExternalClock.upload.speed=115200

## Osso 20MHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.20MHzExternalClock=20MHz xtal
ossoexternalnb.menu.cpu_speed.20MHzExternalClock.build.f_cpu=20000000L
ossoexternalnb.menu.cpu_speed.20MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternalnb.menu.cpu_speed.20MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternalnb.menu.cpu_speed.20MHzExternalClock.upload.speed=115200

## Osso 27MHz external
## --------------------------------------------------
ossoexternalnb.menu.cpu_speed.27MHzExternalClock=27MHz xtal
ossoexternalnb.menu.cpu_speed.27MHzExternalClock.build.f_cpu=27000000L
ossoexternalnb.menu.cpu_speed.27MHzExternalClock.bootloader.low_fuses=0xFF
ossoexternalnb.menu.cpu_speed.27MHzExternalClock.bootloader.extended_fuses=0xFD
ossoexternalnb.menu.cpu_speed.27MHzExternalClock.upload.speed=115200
